hulakov/nossat/sdkconfig.defaults.nossat_lite_box
CONFIG_BSP_NOSSAT_BOX_LITE=y

CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ADC_BUTTON_MAX_BUTTON_PER_CHANNEL=4
#CONFIG_AFE_INTERFACE_V1=y
CONFIG_APP_RETRIEVE_LEN_ELF_SHA=9
CONFIG_BSP_LCD_DRAW_BUF_HEIGHT=10
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
CONFIG_BUTTON_LONG_PRESS_TIME_MS=5000
CONFIG_BUTTON_SHORT_PRESS_TIME_MS=100
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_IPC_TASK_STACK_SIZE=2048
CONFIG_ESP_PHY_MAC_BB_PD=y
CONFIG_ESP_RMAKER_SELF_CLAIM=y
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_TASK_WDT_TIMEOUT_S=7
CONFIG_ESP_WIFI_AMSDU_TX_ENABLED=y
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_RX_BA_WIN=4
CONFIG_ESP_WIFI_SLP_IRAM_OPT=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=3
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=4
CONFIG_ESP_WIFI_TX_BA_WIN=4
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=3120
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_IDF_TARGET="esp32s3"
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FS_POSIX_LETTER=83
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_USE_BMP=y
CONFIG_LV_USE_FS_POSIX=y
CONFIG_LV_USE_GIF=y
CONFIG_LV_USE_PNG=y
CONFIG_LV_USE_QRCODE=y
CONFIG_LV_USE_SJPG=y
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=16
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_TLS_CLIENT_ONLY=y
CONFIG_MODEL_IN_SPIFFS=y
CONFIG_NEWLIB_NANO_FORMAT=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PM_ENABLE=n
CONFIG_PM_POWER_DOWN_CPU_IN_LIGHT_SLEEP=n
CONFIG_PM_POWER_DOWN_TAGMEM_IN_LIGHT_SLEEP=n
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=1024
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=8192
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SR_MN_CN_NONE=y
CONFIG_SR_MN_EN_MULTINET7_QUANT=y
CONFIG_SR_WN_WN9_ALEXA=y
#CONFIG_USE_AFE=y
CONFIG_USE_MULTINET=y
CONFIG_USE_WAKENET=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_USE_PERF_MONITOR=y